n5/src/Catalogs/Reports/Reports.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Reports</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Calculated</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DateEnd</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>DateStart</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Exporter</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>FinancialPeriod</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HasExport</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Master</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>MasterReport</name>
    <type>
      <types>CatalogRef.Reports</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Period</name>
    <type>
      <types>EnumRef.Periods</types>
    </type>
  </attributes>
  <attributes>
    <name>Program</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Template</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
</mdclass:Catalog>

n5/src/InformationRegisters/FieldsDependency/FieldsDependency.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>FieldsDependency</name>
  <dimensions>
    <name>Report</name>
    <type>
      <types>CatalogRef.Reports</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Field</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>DependentReport</name>
    <type>
      <types>CatalogRef.Reports</types>
    </type>
  </dimensions>
  <dimensions>
    <name>DependentField</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

n5/src/Catalogs/Reports/ManagerModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure FormGetProcessing ( FormType, Parameters, SelectedForm, AdditionalInformation, StandardProcessing )
	
	if ( isMaster ( Parameters ) ) then
		SelectedForm = Metadata.Catalogs.Reports.Forms.Master;
		StandardProcessing = false;
	endif; 
	
EndProcedure

Function isMaster ( Parameters )
	
	if ( Parameters.Property ( "IsFolder" )
		and Parameters.IsFolder ) then
		return false;
	endif; 
	master =
	( Parameters.Property ( "FillingValues" )
		and Parameters.FillingValues.Property ( "Master" )
		and Parameters.FillingValues.Master )
	or ( Parameters.Property ( "Key" )
		and DF.Pick ( Parameters.Key, "Master" ) )
	or ( Parameters.Property ( "CopyingValue" )
		and DF.Pick ( Parameters.CopyingValue, "Master" ) );
	return master;
	
EndFunction 

Procedure CopyInternals ( Source, Destination ) export
	
	Destination.Program = new ValueStorage ( Source.Program.Get () );
	Destination.Template = new ValueStorage ( Source.Template.Get () );
	Destination.Exporter = new ValueStorage ( Source.Exporter.Get () );
	
EndProcedure 

Procedure CopyFields ( Source, Destination ) export
	
	from = InformationRegisters.FieldsDependency.Select ( new Structure ( "Report", Source ) );
	set = InformationRegisters.FieldsDependency.CreateRecordSet ();
	set.Filter.Report.Set ( Destination );
	while ( from.Next () ) do
		r = set.Add ();
		r.Report = Destination;
		r.Field = from.Field;
		r.DependentReport = Destination;
		r.DependentField = from.DependentField;
	enddo; 
	set.Write ();
	
EndProcedure 

#endif
